<a href="https://colab.research.google.com/github/GMayer09/Imersao_Dados_Python/blob/main/Aula1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [ ]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [ ]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [ ]:
df.shape

(133349, 11)

In [ ]:
linhas, colunas = df.shape[0], df.shape[1]
print(f"linhas: {linhas}, colunas: {colunas}")

linhas: 133349, colunas: 11

In [ ]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [ ]:
column_mapping = {
    'work_year': 'ano_trabalho',
    'experience_level': 'nivel_experiencia',
    'employment_type': 'tipo_emprego',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda_salario',
    'salary_in_usd': 'salario_em_usd',
    'employee_residence': 'residencia_funcionario',
    'remote_ratio': 'taxa_remoto',
    'company_location': 'localizacao_empresa',
    'company_size': 'tamanho_empresa'
}

df = df.rename(columns=column_mapping)
display(df.head())

,ano_trabalho,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_funcionario,taxa_remoto,localizacao_empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [ ]:
df['nivel_experiencia'].value_counts()

nivel_experiencia
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [ ]:
df["tipo_emprego"].value_counts()

tipo_emprego
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [ ]:
df["taxa_remoto"].value_counts()

taxa_remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [ ]:
df["tamanho_empresa"].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [ ]:
df['nivel_experiencia'] = df['nivel_experiencia'].replace({
    'SE': 'Snior',
    'MI': 'Pleno',
    'EN': 'Jnior',
    'EX': 'Executivo'
})

df['nivel_experiencia'].value_counts()

nivel_experiencia
Snior       77241
Pleno        40465
Jnior       12443
Executivo     3200
Name: count, dtype: int64

In [ ]:
df['tipo_emprego'] = df['tipo_emprego'].replace({
    'FT': 'Tempo Integral',
    'CT': 'Contrato',
    'PT': 'Meio Perodo',
    'FL': 'Freelancer'
})

df['tipo_emprego'].value_counts()

tipo_emprego
Tempo Integral    132563
Contrato             394
Meio Perodo         376
Freelancer            16
Name: count, dtype: int64

In [ ]:
df['taxa_remoto'] = df['taxa_remoto'].replace({
    0: 'Presencial',
    100: 'Remoto',
    50: 'Hbrido'
})

df['taxa_remoto'].value_counts()

taxa_remoto
Presencial    105312
Remoto         27718
Hbrido          319
Name: count, dtype: int64

In [ ]:
df['tamanho_empresa'] = df['tamanho_empresa'].replace({
    'M': 'Mdio',
    'L': 'Grande',
    'S': 'Pequeno'
})

df['tamanho_empresa'].value_counts()

tamanho_empresa
Mdio      129561
Grande       3574
Pequeno       214
Name: count, dtype: int64

In [ ]:
df.head()

,ano_trabalho,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_funcionario,taxa_remoto,localizacao_empresa,tamanho_empresa
0,2025.0,Snior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Mdio
1,2025.0,Snior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Mdio
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Mdio
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Mdio
4,2025.0,Jnior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Mdio

In [ ]:
df.describe(include='object')

,nivel_experiencia,tipo_emprego,cargo,moeda_salario,residencia_funcionario,taxa_remoto,localizacao_empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Snior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Mdio
freq,77241,132563,17314,126140,119579,105312,119641,129561